#include<stdio.h>
#include<string.h>
int main()
{
	int i,j;
	char a[100],b[100],c[200],x,y;
	memset(c, 0, 200);
	scanf("%s%s",a,b);
	x=strlen(a);
	y=strlen(b);
	for(i=x-1;i>=0;i--)
	{
		for(j=y-1;j>=0;j--)
		{
			c[i+j]+=(a[i]-'0')*(b[j]-'0');
			if(i+j>0&&c[i+j]>9)
			{
				c[i+j-1]+=c[i+j]/10;
				c[i+j]=c[j+i]%10;				
			}
		}
	}
	if(c[0]>9)					//原来这里是关键啊。我老在想为什么你就知道结果是多少位，因为10*10 = 100 三位   50*50 = 2500 四位 
	{							//上面全部按三位处理，，就是说两个数相乘 结果的位数 要么是 两数位数之和，要么是两数之和+1   但是我们全按之和处理，这里再加上一位就好了 
		printf("%d",c[0]/10);	
		c[0]=c[0]%10;	
	}
	for(i=0;i<x+y-1;i++)
	printf("%c",c[i]+'0');
	return 0;
 } 
 /*
962346239843253528686293234124
93459382645998213649236498
89940285467448203511141719788602008096526180335759857752
89940285467448203511141719788602008096526180335759857752

 */
