#include <iostream>
using namespace std;
/*

请问：
int *(*(*fp1)(int))[10];
float *(*fp2)(int ,int ,int ))(int); 
int (*(* fp3)())[10](); 

分别表示什么意思
*/

/*
////////////////////////////////////////////////////////////////////////////////

K = (*fp1)(int)   // fp1 是一个函数指针，参数是int
int *(* K )[10];  // 返回值是一个 数组指针  数组里面都是int*

////////////////////////////////////////////////////////////////////////////////

K = (*fp2)(int ,int ,int ) // fp2是一个函数指针，参数是 int，int，int 
float (* K )(int); 			// 返回值是一个函数指针，这个指针参数是 int 返回值是float 

////////////////////////////////////////////////////////////////////////////////

K = (* fp3)();		//fp3是一个函数指针，参数是void 
int (* K )[10](); 	// K 是一个数组指针，数组里面每个元素都是一个函数指针，每个函数指针 参数是void 返回值是int 

fp3是一个函数指针，参数是void 返回值是一个指向一些函数的 指针数组 

////////////////////////////////////////////////////////////////////////////////
*/

void test()
{
	

	int a[2] = { 1, 2 };
	int(*p)[2];//	= {1,2};//不能这样初始化  这样p就算是没初始化，没地址 
	p = &a;

	for (int i = 0; i < 2; i++)
		cout << (*p)[i] << endl;
}
void test2()
{
	int x = 3,y = 4;
	int *c[2] = {&x,&y};		//c是一个指针数组 
	int *( *p )[2] = &c;		//p是一个数组指针  这个数组里面每个元素都是指针     也可以说是   p 指向了一个 指针数组 
	
	for(int i = 0;i<2;i++)
		cout<<*(*p)[i]<<endl;
}

int main()
{
	test2();

}
